import React from "react";

function PersonalAgreementPage() {
  return (
    <div
      style={{
        width: "1200px",
        height: "fit-contenet",
        background: "rgba(6, 75, 140, 0.8)",
        padding: "10px",
        marginBottom: "20px",
      }}
    >
      <span>
        Оставляя на сайте, размещенном по веб-адресу: <b>okamianime.com</b>{" "}
        (далее – Сайт), любые из Ваших данных (которые отнесены к категории
        персональных в соответствии с ФЗ «О персональных данных» от 27.07.2006
        №152-ФЗ), путем заполнения полей любых форм на Сайте, Вы автоматически
        присоединяетесь к настоящему Соглашению, приобретаете статус
        пользователя Сайта (далее-Пользователь Сайта) и соглашаетесь со всеми
        без исключения его условиями.
        <ol style={{ marginLeft: "20px" }}>
          Пользователь Сайта:
          <li>
            Подтверждает, что все указанные им в формах регистрации на Сайте
            данные принадлежат лично ему, соответствуют действительности, не
            искажены.
          </li>
          <li>
            Подтверждает и признает, что им внимательно в полном объеме
            прочитано настоящее Соглашение и условия обработки его персональных
            данных. Текст Соглашения и условия обработки персональных данных ему
            понятны и он с ними согласен;
          </li>
          <li>
            Дает согласие на обработку Администрацией Сайта предоставляемых в
            составе информации персональных данных в целях заключения между ним
            и Сайтом настоящего Соглашения, а также его последующего исполнения;
          </li>
          <li>
            Выражает согласие с условиями обработки персональных данных без
            оговорок и ограничений.
          </li>
          <li>
            В соответствии с ФЗ «О персональных данных» от 27.07.2006 №152-ФЗ
            свободно, своей волей и в своем интересе выражает согласие на сбор,
            анализ, обработку, хранение и использование своих персональных
            данных (ФИО, дата рождения, паспортные данные, места пребывания,
            адрес проживания, мобильный телефон, домашний телефон, электронный
            адрес (E-mail), реквизиты банковских карт, прочие данные). Согласие
            Пользователя Сайта на обработку персональных данных является
            конкретным, информированным и сознательным.
          </li>
        </ol>
        Настоящее согласие Пользователя Сайта признается исполненным в простой
        письменной форме. Пользователь Сайта предоставляет Администрации Сайта
        право осуществлять следующие действия (операции) с персональными
        данными:
        <ol style={{ marginLeft: "20px" }}>
          <li> сбор и накопление;</li>
          <li>
            хранение в течение установленных нормативными документами сроков
            хранения отчетности, но не менее трех лет, с момента даты
            прекращения пользования услуг Пользователем Сайта;
          </li>
          <li> уточнение (обновление, изменение); </li>
          <li> использование;</li>
          <li> уничтожение;</li>
          <li> обезличивание;</li>
          <li>
            передача по требованию суда, в том числе, третьим лицам, с
            соблюдением мер, обеспечивающих защиту персональных данных от
            несанкционированного доступа. Указанное согласие действует бессрочно
            с момента предоставления данных и может быть отозвано Пользователем
            Сайта путем подачи заявления Администрации Сайта с указанием данных,
            определенных ст. 14 Федерального закона от 27.07.2006 N 152-ФЗ «О
            персональных данных» (ред. от 22.02.2017г.)
          </li>
        </ol>
        Отзыв согласия на обработку персональных данных может быть осуществлен
        путем направления Пользователем соответствующего распоряжения в простой
        письменной форме на адрес электронной почты{" "}
        <a href="email">kakashki@anime.ru</a>. Администрация Сайта не несет
        ответственности за использование (как правомерное, так и неправомерное)
        третьими лицами Информации, размещенной Пользователем Сайта на Сайте,
        включая её воспроизведение и распространение, осуществленные всеми
        возможными способами. Администрация Сайта в любое время имеет право
        вносить изменения в настоящее Соглашение. При внесении изменений в
        актуальной редакции указывается дата последнего обновления. Новая
        редакция Соглашения вступает в силу с момента ее размещения, если иное
        не предусмотрено новой редакцией Соглашения. К настоящему Соглашению и
        отношениям между Пользователем Сайта и Администрацией Сайта, возникающим
        в связи с применением Соглашения, подлежит применению действующее
        законодательство Российской Федерации.
      </span>
    </div>
  );
}
export default PersonalAgreementPage;
